coanda_simple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          85;
        startFace       33647;
    }
    right
    {
        type            patch;
        nFaces          75;
        startFace       33732;
    }
    up
    {
        type            patch;
        nFaces          85;
        startFace       33807;
    }
    meanFlow
    {
        type            patch;
        nFaces          92;
        startFace       33892;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          357;
        startFace       33984;
    }
    coandaUpper
    {
        type            patch;
        nFaces          10;
        startFace       34341;
    }
    coandaLower
    {
        type            patch;
        nFaces          10;
        startFace       34351;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          34004;
        startFace       34361;
    }
)

// ************************************************************************* //
